# Selecting Rows and Columns

For this exercise we will be working with `yob_1880.csv` file.

### 1. Read Data

Import pandas

In [1]:
import pandas as pd

Locate the `yob_1880.csv`file and read it in `df`dataframe.

In [2]:

df = pd.read_csv('../data/yob_1880.csv', index_col=0)

### 2. Inspect Data

How many columns and rows are there in the dataframe?

In [3]:
df.shape

(2000, 2)

Display the first 3 rows.

In [4]:
df.head(3)

     gender  frequency
name
Mary      F       7065
Anna      F       2604
Emma      F       2003

Display the last 3 rows.

In [5]:
df.tail(3)

          gender  frequency
name
Wright         M          5
York           M          5
Zachariah      M          5

### 3. Select Columns

Display only the `gender`column

In [6]:
df['gender']

name
Mary         F
Anna         F
Emma         F
Elizabeth    F
Minnie       F
            ..
Woodie       M
Worthy       M
Wright       M
York         M
Zachariah    M
Name: gender, Length: 2000, dtype: object

Display `gender`and `frequency`columns. Display only first 3 rows with these columns.

In [7]:
col_names = ['gender', 'frequency']
df[col_names].head(3)

     gender  frequency
name
Mary      F       7065
Anna      F       2604
Emma      F       2003

### 4. Select Rows

Display data for row(s) containing `Anna`

In [8]:
df.loc['Anna']

     gender  frequency
name
Anna      F       2604
Anna      M         12

Display the data for all rows with `William`, `Paul`, and `Anne`.

In [9]:
df.loc[['William', 'Paul', 'Anne']]

        gender  frequency
name
William      F         30
William      M       9532
Paul         M        301
Anne         F        136

Display the `frequency` column for `William`, `Paul`, and `Anne`.

In [10]:
df.loc[['William', 'Paul', 'Anne'],['frequency']]

         frequency
name
William         30
William       9532
Paul           301
Anne           136

Display both columns for every second name.

In [11]:
df.loc[::2]

        gender  frequency
name
Mary         F       7065
Emma         F       2003
Minnie       F       1746
Ida          F       1472
Bertha       F       1320
...        ...        ...
Unknown      M          5
Wes          M          5
Wood         M          5
Worthy       M          5
York         M          5

[1000 rows x 2 columns]

Set index to column `gender`and store it in another dataframe.

In [12]:
gender= df.set_index('gender')
gender

        frequency
gender
F            7065
F            2604
F            2003
F            1939
F            1746
...           ...
M               5
M               5
M               5
M               5
M               5

[2000 rows x 1 columns]

Display first 3 rows of this new dataframe where `gender`is `M`

In [13]:
gender.loc['M'].head(3)

        frequency
gender
M            9655
M            9532
M            5927